Repository: ThiefMaster/react-jsx-i18n
Catalog: test-data/*.po
Languages: de_de

source: "<strong>Rats.</strong>"
de_de: "<strong>Ratten.</strong>"

source: You are ugly!
de_de: Du bist hässlich!

source: cat
de_de: Katze

source: one {foo}
de_de: ein {foo}

source: mixed: {mixedCase}
de_de: gemischt: {mixedCase}

source: You have {count} rat.
de_de: Du hast {count} Ratte.

source: Hello & World
de_de: Hallo & Welt

source: Hey {name}, you want to {link}click me{/link} and you know it!
de_de: Hey {name}, du willst {link}mich anklicken{/link} und weißt das auch!

source: Bye World
de_de: Tschüss Welt

source: Some <HTML> & entities: → &
de_de: Etwas <HTML> & Entities: → &

source: Hover me
de_de: Hover mich

source: <HTML> is unescaped when extracted
de_de: <HTML> wird unescaped extracted

source: xxx foo bar{test}{x} y{/x} moo
de_de: xxx foo bar{test}{x} y{/x} muh

source: Little cats:
de_de: Junge Katzen:

source: Little dogs:
de_de: Junge Hunde:

source: This is an emphasized dynamic value: {number}
de_de: Das ist ein hervorgehobener dynamischer Wert: {number}

source: This is an emphasized translated value: {tag}hello{/tag}
de_de: Das ist ein hervorgehobener übersetzter Wert: {tag}hallo{/tag}

source: This param is using string literals: {emphasize}hello world{/emphasize}
de_de: Dieser Parameter verwendet String Literals: {emphasize}Hallo Welt{/emphasize}

# cat
source: offspring
de_de: Kätzchen

# big
source: cat
de_de: KATZE

# c
source: one {foo}
de_de: ein {foo}

# dog
source: offspring
de_de: Welpe
